package lessons.lesson04.homework

class Homework {

    val v1: Byte = 42
    val v2: Long = 98765432123456789L
    val v3: Float = 23.45f
    val v4: Double = 0.123456789
    val v5: String = "Kotlin & Java"
    //FALSE должно быть не капсом
    //val v6: Boolean = FALSE
    val v7: Char = 'c'
    val v8: Int = 500
    val v9: Long = 4294967296L
    val v10: Float = 18.0f
    val v11: Double = -0.001
    val v12: String = "OpenAI"
    val v13: String = "true"
    val v14: List<Byte> = listOf(3, 14)
    val v15: Char = '9'
    val v16: Int = 2048
    val v17: Long = 10000000000L
    val v18: Set<String> = setOf("OpenAI", "Quantum Computing")
    val v19: Float = 5.75f
    //Неверный тип кавычек, должны быть двойные
    //val v20: String = `1.414`
    val v21: String = "Artificial Intelligence"
    val v22: Array<Any> = arrayOf('x', "A")
    val v23: String = "Android Studio"
    val v24: Char = '@'
    val v25: Int = 1024
    val v26: Long = 1234567890123L
    val v27: Float = 10.01f
    val v28: Double = -273.15
    val v29: String = "SpaceX"
    //FALSE должно быть не капсом
    //val v30: Boolean = FALSE
    val v31: Double = 0.007
    //недопустимый тип кавычек, должны быть прямые
    //val v32 = “🤯”
    val v33: Map<String, Byte> = mapOf("true" to 2, "false" to 34)
    //недопустимый тип кавычек, должны быть двойные
    //val v34: String = ‘65535’
    val v35: Long = 72057594037927935L
    val v36: Float = 2.71828f
    val v37: Double = 101.0101
    val v38: String = "Quantum Computing"
    val v39: Map<Int, String> = mapOf(2 to "true", 34 to "false")
    val v40: Char = 'x'
    val v41: Int = 314
    val v42: Long = 123456789123456789L
    val v43: Float = 6.626f
    //TRUE должно быть не капсом
    //val v44 = TRUE


//    1. Хранить букву, на которую указывает палец медиума во время спиритического сеанса.
    val chosenLetter: Char = 'f'
//    2. Хранить количество ложек сахара, которые я кладу в одну чашку чая.
    val numberOfTeaSpoons: Byte = 10
//    3. Хранить список расходов на доставку еды, чтобы ещё раз убедиться, что готовить было дешевле.
    val deliveryLosses: Array<Float> = arrayOf(10239.99f, 4560.0f)
//    4. Хранить длину очереди в столовой до миллиардной доли сантиметра.
    val diningQueue: Double = 2.000000001
//    5. Хранить факт, закрыт ли баг после того, как его просто переименовали в фичу.
    val isBugClosed: Boolean = true
//    6. Хранить количество свистков чайника за день.
    val kettleNoises: Int = 172
//    7. Хранить количество нажатий котом на клавиатуру ноутбука за всё время твоей работы.
    val pawPresses: Long = 2130921039021L
//    8. Хранить количество попыток пересчитать звёзды на небе за всю историю человечества.
    val countingStarsTries: Long = 213921839128391283L
//    9. Хранить массу воздуха в спускающем матрасе после нападения кота в долях грамма.
    val airMassAfterCatAttack: Double = 13.2342
//    10. Хранить словарь «название стартапа → сумму потерь инвесторов».
    val startupLosses: Map<String, Float> = mapOf("название стартапа" to 123445.99f)
//    11. Хранить строку «починилось само», чтобы закрывать тикеты без лишних слов.
    val leKostyl: String = "починилось само"
//    12. Хранить список тем для митингов, которые на самом деле никому не нужны.
    val meetThemes: List<String> = listOf("скучная тема один", "бесполезная тема два")
}